[
  {
    "department_id": 1,
    "department": "Diseño Gráfico",
    "description": "Recursos y herramientas para la creación y edición de elementos visuales, incluyendo colores, tipografías y plantillas."
  },
  {
    "department_id": 2,
    "department": "Recursos Visuales",
    "description": "Colección de imágenes, ilustraciones, iconos y modelos 3D para mejorar los diseños visuales en proyectos gráficos y digitales."
  },
  {
    "department_id": 3,
    "department": "Recursos de Audio y Video",
    "description": "Herramientas y recursos multimedia para la creación y edición de contenido de audio y video, como plantillas y efectos."
  },
  {
    "department_id": 4,
    "department": "Programación",
    "description": "Recursos  y frameworks para el desarrollo de software, incluyendo APIs, componentes y herramientas útiles para programadores."
  },
  {
    "department_id": 5,
    "department": "Contenido",
    "description": "Fuentes de contenido en línea como YouTubers, blogs y documentación para programadores y diseñadores que buscan aprender y mejorar sus habilidades."
  },
  {
    "department_id": 6,
    "department": "Inteligencia Artificial",
    "description": "Herramientas basadas en IA para la generación de texto, imágenes y videos, aplicadas tanto a programación como a diseño."
  },
  {
    "department_id": 7,
    "department": "Inspiración",
    "description": "Recopilación de portafolios creativos, tendencias y desafíos para motivar la creatividad en diseño y programación."
  },
  {
    "department_id": 8,
    "department": "Herramientas Útiles",
    "description": "Conjunto de herramientas para facilitar tareas comunes como compresión de imágenes, eliminación de fondos y optimización de recursos."
  },
  {
    "department_id": 9,
    "department": "Marketing Digital",
    "description": "Estrategias y herramientas para mejorar la visibilidad y promoción de productos o servicios en línea, incluyendo SEO, redes sociales y email marketing."
  },
  {
    "department_id": 10,
    "department": "Desarrollo de Juegos",
    "description": "Recursos y plataformas para la creación y distribución de videojuegos, incluyendo motores de juego, assets y tutoriales."
  },
  {
    "department_id": 11,
    "department": "Librerías",
    "description": "Conjunto de librerías y frameworks para facilitar el desarrollo de aplicaciones, desde interfaces de usuario hasta la gestión de datos y APIs."
  },
  {
    "department_id": 12,
    "department": "Negocios",
    "description": "Estrategias y herramientas para la gestión empresarial, incluyendo marketing, finanzas, transformación digital y gestión de proyectos."
  }
]
